Repository: 84000/data-translation-memory
Catalog: toh55_84000-the-teaching-on-the-effulgence-of-light.tmx
Source language: bo
Languages: en

source: །ཐམས་ཅད་སྦྱིན་པ་ལས་སྐྱེ་སྟེ། །དེང་འདིར་ཅུང་ཟད་བསྟན་པར་བྱ།
en: That arise on the basis of generosity.

source: །ཁྱོད་ཀྱིས་འཁོར་འདུས་མང་པོ་ལ།
en: “Those accumulations of generosity

source: །མཉམ་པའི་སེམས་ཀྱིས་གང་མཆོད་པ།
en: That you have offered with an impartial mind

source: །སྦྱིན་པའི་ཚོགས་ནི་དེ་དག་ལ།
en: In the presence of these numerous assemblies

source: །མཁས་པ་རྣམས་ཀྱིས་བསྒྲུབ་པར་བྱ།
en: Should be accomplished by all the wise ones.

source: །སྦྱིན་པ་འདི་ཡིས་བསགས་པ་ཡི།
en: “The mass of merit accumulated

source: །བསོད་ནམས་ཕུང་པོ་བསམ་མི་ཁྱབ།
en: Through these acts of generosity is inconceivable; It will cause you to perfect

source: །མཚན་དང་དཔེ་བྱད་ལུས་བརྒྱན་པ། །ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་འགྱུར།
en: All the physical adornments of the major and minor marks.

source: །སྐྱེ་གནས་དང་ནི་རུས་རིགས་དང་། །ཡུལ་རྣམས་དང་ནི་ཁྱིམ་དག་དང་། །གྲགས་པ་དང་ནི་གཟུགས་དང་སེམས།
en: “All your birthplaces, your family lines, Your lands, your households, Your renown, your bodies, and your minds

source: །ཐམས་ཅད་ཡོངས་སུ་དག་པར་འགྱུར།
en: Will be pure.

source: །ལྷ་རྣམས་རྫུ་འཕྲུལ་དངོས་པོ་དང་། །གཞལ་མེད་ཁང་དང་ལྷ་མོ་དང་། །རྣམ་དག་ཐོགས་མེད་སྤོབས་པ་ཡང་།
en: “All the divine miraculous displays, The palaces, the goddesses, And the pure, unimpeded eloquence

source: །སྦྱིན་པ་ལས་ནི་བྱུང་བ་ཡིན།
en: Originate from generosity. “The buddhas praise

source: །སྦྱིན་པའི་ཚོགས་མཆོག་གང་ཡིན་པ།
en: The supreme accumulation of generosity

source: །སངས་རྒྱས་རྣམས་ཀྱིས་འདི་སྐད་དུ། །འདི་ནི་དང་པོར་བྱང་ཆུབ་རྣམས།
en: By proclaiming that it is

source: །གནས་པའི་གཞི་ཞེས་བསྔགས་པར་མཛད།
en: The foremost foundation of awakening.

source: །བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་ཅན།
en: “Diligent bodhisattvas

source: །སྦྱིན་ལ་ཐེ་ཚོམ་མེད་པ་དག །ངེས་པའི་སེམས་ལ་རབ་གནས་ནས།
en: Who have no doubt about generosity Accomplish it persistently

source: །སྦྱིན་པ་ནན་ཏན་བསྒྲུབ་པར་གྱིས།
en: And with full conviction.

source: །སྦྱིན་པའི་སེམས་ནི་གང་དག་གིས།
en: “If bodhisattvas perfect

source: །བསོད་ནམས་ཚོགས་ནི་རྫོགས་བྱེད་པ།
en: The accumulation of merit

source: །བྱང་ཆུབ་སེམས་དཔས་སྒྲུབ་བྱེད་ན།
en: With a generous mindset,

source: །སངས་རྒྱས་བྱང་ཆུབ་འཐོབ་པར་འགྱུར།
en: They will achieve the awakening of the buddhas. “Since they perfect the supreme miraculous powers

source: །སྦྱིན་པའི་མཐུ་ཡི་སྟོབས་ཀྱིས་ནི། །རྫུ་འཕྲུལ་མཆོག་ནི་རྫོགས་བྱེད་པས།
en: Through the strength of generosity,

source: །ཞིང་ནི་བྱེ་བ་བསྒུལ་བྱས་ཀྱང་།
en: Even if they cause ten million realms to shake,

source: །སེམས་ཅན་རྣམས་ལ་གནོད་མི་འགྱུར།
en: Sentient beings will not be harmed.

source: །སྦྱིན་པ་བཏང་བའི་དབང་གིས་ན།
en: “The power of the practice of generosity Induces pure discipline, erudition,

source: །རྣམ་དག་ཚུལ་ཁྲིམས་མང་ཐོས་དང་། །ཡང་དག་ཡིད་ཆེས་བརྩོན་འགྲུས་དང་། །ཏིང་འཛིན་ཟག་མེད་ཤེས་རབ་འདྲེན།
en: Genuine trust, diligence, Absorption, and undefiled insight.

source: །དབང་པོ་སྟོབས་དང་ཡང་དག་ལམ།
en: Induces the powers , the strengths, the authentic path,

source: །ཡང་དག་སྤོང་དང་རྫུ་འཕྲུལ་རྐང་།
en: The exertions, the bases of miraculous power,

source: །བག་ཆགས་སྤོང་བ་འདྲེན་པར་བྱེད།
en: And the abandonment of latent patterns.

source: །སྦྱིན་པ་བཏང་བའི་དབང་གིས་ན། །རྣམ་དག་སྒྲ་སྙན་དག་གིས་ནི།
en: “The power of the practice of generosity

source: །ཞིང་ནི་བྱེ་བ་བརྒྱ་ཕྲག་ཏུ། །དཔག་མེད་ཆོས་སྟོན་འདྲེན་པར་བྱེད།
en: Causes the boundless Dharma To be taught in billions of realms Through pure and melodious voices.

source: །ཡོངས་སུ་དང་བས་སྦྱིན་བཏང་བས།
en: “By practicing generosity with sincere faith,

source: །རྫུ་འཕྲུལ་རྣམས་ནི་མྱུར་དུ་འཐོབ།
en: One will swiftly achieve the miraculous powers;

source: །རྫུ་འཕྲུལ་ཡོངས་སུ་རྫོགས་བྱའི་ཕྱིར།
en: In order to perfect those miraculous powers,

source: །ནན་ཏན་སྦྱིན་པ་གཏང་བར་གྱིས།
en: One should therefore practice generosity persistently.

source: །ལྷ་ནི་མང་པོ་ཚད་མེད་རྣམས།
en: “If rulers—like those who play freely In their sublime palaces

source: །ལྷ་མ་ཡིན་དང་ཀླུ་རྣམས་དང་། །གནོད་སྦྱིན་བརྒྱ་སྟོང་མང་པོ་དང་། །འཁོར་རྣམས་ཀྱིས་ནི་ཡོངས་བསྐོར་ནས། །གཞལ་མེད་ཁང་མཆོག་རབ་ཞུགས་ཏེ། །རང་དབང་དག་གིས་རྩེ་བྱེད་པ།
en: While surrounded by retinues Of countless gods and many hundreds of thousands

source: །འདི་ལ་སོགས་པའི་རྒྱལ་པོ་རྣམས།
en: “Of asuras, nāgas, and yakṣas—

source: །སྦྱིན་ལ་བརྩོན་པ་མཐོང་གྱུར་ན།
en: See beings who exert themselves in the practice of generosity,

source: །ཐམས་ཅད་ལངས་ནས་བསུ་ནས་ནི།
en: They will all stand up, welcome them,

source: །སྟན་བཏིང་མཆོད་པ་དག་ཀྱང་བྱེད།
en: Lay out seats for them, and worship them.

source: །སྦྱིན་གཏོང་གང་ཟག་གང་ཡིན་པ།
en: “Since the persons who practice generosity

source: །གཟི་བྱིན་ཆེན་པོ་ཕུན་ཚོགས་ཤིང་།
en: Are endowed with perfect great majesty

source: །རྫུ་འཕྲུལ་སྟོབས་ལ་དབང་ཐོབ་པས།
en: And have gained mastery over the miraculous powers,

source: །ལྷ་རྒྱལ་རྣམས་ནི་སྡུད་པར་བྱེད།
en: They will attract the kings of the gods.

source: །གྲུལ་བུམ་དང་ནི་གནོད་སྦྱིན་རྣམས།
en: “All the kumbhāṇḍas and the yakṣas

source: །ཐམས་ཅད་སྐྱབས་སུ་འགྲོ་བར་འགྱུར།
en: Will go to them for refuge,

source: །དྲི་ཟ་འཁོར་བཅས་རྣམས་ཀྱིས་ཀྱང་།
en: And the gandharvas and their retinues

source: །རོལ་མོ་དག་གིས་མཆོད་པར་བྱེད།
en: Will worship them by playing music.

source: །ཆོམ་རྐུན་དག་ནི་བྱམས་སེམས་བསྐྱེད།
en: “All bandits will become kind,

source: །མ་རུངས་པ་རྣམས་རིང་དུ་འགྲོ།
en: All hostile beings will leave for faraway places,

source: །ནོར་རྣམས་ཉམས་པར་མི་འགྱུར་ཏེ།
en: One’s wealth will never decline,

source: །བང་མཛོད་དག་ནི་གང་བར་འགྱུར།
en: And the storerooms will always be full.

source: །སྦྱིན་པ་ཡོངས་སུ་བཏང་བའི་ཕྱིར།
en: “By practicing generosity,

source: །ཚོགས་མཆོག་དག་ནི་རྫོགས་པར་འགྱུར།
en: The supreme accumulations will be perfected,

source: །སངས་རྒྱས་ཡེ་ཤེས་ཐུག་བར་དུ།
en: And, until awakened wisdom is achieved,

source: །མུ་སྟེགས་ཆོས་ནི་སྤྱོད་མི་བྱེད།
en: They will not engage in the practices of non-Buddhists.

source: །དེ་ལ་ན་བ་ཡོང་མེད་དེ།
en: “One will never fall sick,

source: །གཟུངས་རྣམས་ཡོངས་སུ་སྲུང་བར་བྱེད།
en: And one will be protected by the dhāraṇīs.

source: །ཁྱད་པར་འཕགས་པའི་སྟོབས་རྣམས་ཀྱང་།
en: Even the extraordinary strengths

source: །དེ་ལྟར་སྦྱིན་པ་གང་གཏོང་བ།
en: “In that way, those who practice generosity

source: །བྱང་ཆུབ་ལམ་ནི་སྒྲུབ་པར་བྱེད།
en: Will accomplish the path of awakening;

source: །མི་དགེ་བཤེས་གཉེན་ཕྲད་མི་འགྱུར།
en: They will never meet nonvirtuous friends

source: །སྤྱོད་འཐུན་གྲོགས་པོ་འཐོབ་པར་འགྱུར།
en: But will gain friends with conducive behaviors.

source: །གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས།
en: “Furthermore, since bodhisattvas

source: །སྦྱིན་པའི་ཚོགས་ནི་སོགས་བྱེད་པ།
en: Who gather the accumulation of generosity

source: །བསམ་གྱིས་མི་ཁྱབ་གཟུངས་དག་དང་། །ཤེས་རབ་ཡོངས་སུ་རྫོགས་བྱེད་པས།
en: Will perfect the inconceivable dhāraṇīs And insight, “They will reveal thorough comprehension

source: །ཚིགས་སུ་བཅད་པ་ཚད་མེད་ཀྱིས། །ཀུན་འཛིན་ཡང་དག་སྟོན་པར་བྱེད།
en: Through countless verses.

source: །ཐམས་ཅད་ལ་ནི་ཐོགས་མེད་པས།
en: Since they will be unimpeded in all respects,

source: །ངོ་བོ་ཉིད་དོན་སྟོར་མི་འགྱུར།
en: They will not lose the essential meaning. “They will be firmly dedicated

source: །བྱང་ཆུབ་སེམས་ནི་རྒྱ་ཆེ་ལ།
en: To the vast attitude set on awakening,

source: །མོས་པའི་སེམས་ནི་བརྟན་པར་འགྱུར། །ཚུལ་ཁྲིམས་དག་པ་ཕུན་ཚོགས་ཤིང་།
en: Their discipline will be pure and perfect,

source: །བདུད་ཀྱི་ལས་རྣམས་སྤོང་བར་བྱེད།
en: And they will overcome the activities of Māra.

source: །འདོད་པ་ལྔ་ལ་ཞེན་མེད་ཅིང་།
en: “They will not cling to the five sense pleasures

source: །རྩེ་གཅིག་ཡང་དག་དྲན་པ་ཚོལ།
en: But will pursue recollection one-pointedly.

source: །སེམས་ལ་རྟག་ཏུ་རྨོངས་མེད་པས།
en: Since their minds are constantly free of delusion,

source: །འདོད་པ་དག་ལ་སྲེད་མི་སྐྱེད།
en: They will not crave sense pleasures. “They will genuinely understand

source: །ཞེ་སྡང་ཉོན་མོངས་གང་ཡིན་པ། །ཡང་དག་ཇི་བཞིན་རབ་ཏུ་རྟོགས། །སྤྱོད་ཡུལ་དག་ནི་ཐམས་ཅད་ལ།
en: The affliction of anger,

source: །ཞེན་པ་མེད་ཅིང་རྨོངས་པ་མེད།
en: And they will be free of clinging and delusion

source: །གང་ཟག་དེས་ནི་ཉོན་མོངས་རྣམས།
en: With respect to all the domains of experience.

source: །ལེགས་པ་ཉིད་དུ་རྟོགས་པར་འགྱུར།
en: “Those persons will properly understand All afflictions as well as everything else—

source: །རྒྱུ་དང་རྐྱེན་ནི་འདུས་པ་ལས། །ཉེས་དམིགས་རྣམས་ནི་སྐྱེ་བ་ནས།
en: From the defects that arise From the gathering of causes and conditions,

source: །སངས་རྒྱས་ཆོས་ཀྱི་བར་དག་གི །རྒྱུ་དང་རྒྱུ་ཡི་རྒྱུ་ཉིད་དང་། །དེ་བཞིན་རྒྱུ་ཡི་བྱ་བ་རྣམས།
en: Up to the causes Of the qualities of the buddhas, The causes of their causes, And the effects of those causes.

source: །དེས་ནི་མིག་ཟད་མཐའ་ཡི་རྒྱུ། །གང་ཡིན་རབ་ཏུ་རྟོགས་པས་ན།
en: The causes of the limit of the exhaustion of the eye,

source: །རྨོངས་པ་རྣམས་ནི་ཡོངས་སྤངས་ནས།
en: They will completely abandon delusion

source: །མིག་ལ་མངོན་པར་ཞེན་མི་འགྱུར།
en: And will not cling to the eye. “Since they will also clearly understand

source: །དེས་ནི་མིག་གི་སྐྱེ་མཐའ་དང་། །མཐའ་དང་རབ་ཏུ་དབེན་པ་དང་། །འཇུག་པ་དང་ནི་མེད་པ་དང་། །མི་སྐྱེ་བ་ནས་ཉེར་ཞིའི་བར།
en: The causes of the limit of the arising of the eye, Its limit, its disengagement, Its cognition, its nonexistence, “And its unborn nature,

source: །འདི་ལ་སོགས་པའི་རྒྱུ་ཉིད་ཀྱང་། །རབ་ཏུ་རྟོགས་པར་གྱུར་བས་ན།
en: Up to its quiescence and so forth,

source: །དེས་ནི་མིག་གི་སྔོན་མཐའ་ཡི། །བརྗོད་པ་འཇིག་རྟེན་རྗེས་སུ་ནི།
en: “They will realize that the expression past limit of the eye

source: །བཏགས་པ་ཡིན་པས་དེ་ལ་ནི། །ཡང་དག་ཅི་ཡང་མེད་པར་རྟོགས། །དེས་ནི་མིག་གི་ཕྱི་མཐའ་ཡི།
en: Is a mere imputation

source: །བརྗོད་པ་འཇིག་རྟེན་རྗེས་སུ་ནི།
en: That accords with the world’s conventions,

source: །བཏགས་པ་ཡིན་པས་དེ་ལ་ནི། །ཡང་དག་ཅི་ཡང་མེད་པར་རྟོགས།
en: And that it is therefore, ultimately, completely nonexistent. “They will also realize that the expressions

source: །དེས་ནི་མིག་གི་སྐྱེ་མཐའ་དང་། །མཐའ་དང་རབ་དབེན་འཇུག་པ་དང་། །ཅི་ཡང་མེད་དང་སྐྱེ་མེད་ནས།
en: The limit of the arising of the eye , Its limit , its disengagement , its cognition , Its complete nonexistence , and its unborn nature

source: །ཉེ་བར་ཞི་བའི་བར་དག་དང་། །འདི་ལ་སོགས་པའི་བརྗོད་པ་རྣམས།
en: “Up to its peace , Are all mere imputations

source: །འཇིག་རྟེན་རྗེས་སུ་བཏགས་པས་ན།
en: That accord with the world’s conventions,

source: །དེ་ལ་ཡང་དག་མེད་པར་ནི།
en: And that therefore they, too, are ultimately nonexistent.

source: །རབ་ཏུ་རྟོགས་པར་འགྱུར་བ་ཡིན།
en: “Since they will realize that the expression

source: །དེས་ནི་མིག་གི་སྔོན་མཐའ་ཡི།
en: Past limit of the eye

source: །བརྗོད་པ་རྒྱུ་རྐྱེན་འདུས་པ་ལས། །བྱུང་བ་ཉིད་དུ་རྟོགས་པས་ན།
en: Arises from the gathering of causes and conditions,

source: །དེ་ལ་ཞེན་པ་ཅི་ཡང་མེད།
en: They will not cling to it at all. “Since they will realize that the expression

source: །དེས་ནི་མིག་གི་ཕྱི་མཐའ་ཡི།
en: Future limit of the eye

source: །རྒྱུ་དང་རྐྱེན་ནི་འདུས་པ་ལས། །བྱུང་བ་ཉིད་དུ་རྟོགས་པས་ན།
en: Arise from the gathering Of causes and conditions,

source: །བརྗོད་པའི་རང་བཞིན་བསྟན་མེད་པར། །རབ་ཏུ་རྟོགས་པར་གྱུར་པས་ན།
en: Is intrinsically undefinable,

source: །བརྗོད་པ་རང་བཞིན་བསྟན་མེད་པར། །རབ་ཏུ་རྟོགས་པར་གྱུར་པས་ན།
en: Is intrinsically undefinable,

source: །རང་བཞིན་གྱིས་ནི་བསྟན་མེད་པར། །རབ་ཏུ་རྟོགས་པར་གྱུར་པས་ན།
en: Are intrinsically undefinable,

source: །འཇིག་རྟེན་སྐྱེ་བའི་མིང་གི་བར།
en: Up to the names produced in the world.

source: །དེས་ནི་འདོད་ཆགས་སངས་རྒྱས་ལམ།
en: That desire and the path of the buddhas

source: །རང་བཞིན་དབྱེར་མེད་ཡིན་པར་ནི། །རབ་ཏུ་རྟོགས་པར་གྱུར་པས་ན།
en: Are intrinsically inseparable,

source: །འདོད་ཆགས་ལ་ནི་ཞེན་པ་མེད།
en: They will not cling to desire.

source: །སངས་རྒྱས་ལམ་ནི་ཐམས་ཅད་ཀུན།
en: “All the paths of the buddhas

source: །ཉོན་མོངས་ལས་ནི་བཙལ་བར་བྱ།
en: Should be pursued on the basis of afflictions.

source: །རང་བཞིན་དབྱེར་མེད་རབ་ཤེས་ན།
en: Those who clearly understand that these are intrinsically inseparable

source: །ཀུན་འཛིན་སྒོར་ནི་ཞུགས་པ་ཡིན།
en: Will enter the gateway of thorough comprehension. “Those who teach that desire is thorough comprehension

source: །འདོད་ཆགས་ཀུན་འཛིན་ཡིན་པ་དང་། །ཀུན་འཛིན་འདོད་ཆགས་ཡིན་སྟོན་ཅིང་།
en: And that thorough comprehension is desire,

source: །ཀུན་འཛིན་སྒོར་ནི་སློབ་པ་ཡིན།
en: Will train in the gateway of thorough comprehension.

source: །དེ་བཞིན་འདོད་ཆགས་གང་མཆོད་པ།
en: “Likewise, those who worship desire

source: །དེ་ནི་སངས་རྒྱས་མཆོད་པ་ཡིན།
en: Worship the Buddha,

source: །སངས་རྒྱས་ལ་ནི་མཆོད་པའི་ཕྱིར།
en: And since they worship the Buddha,

source: །ཀུན་འཛིན་སྒོར་ནི་རྫོགས་པར་འགྱུར།
en: They will perfect the gateway of thorough comprehension. “Since they realize

source: །དེས་ནི་ཞེ་སྡང་སངས་རྒྱས་ལམ།
en: That anger and the path of the buddhas

source: །རང་བཞིན་དབྱེར་མེད་ཡིན་པར་ནི། །རབ་ཏུ་རྟོགས་པར་གྱུར་བས་ན།
en: Are intrinsically inseparable,

source: །ཞེ་སྡང་ལ་ནི་ཞེན་པ་མེད།
en: They will not cling to anger. “Those who teach that anger is thorough comprehension

source: །ཞེ་སྡང་ཀུན་འཛིན་ཡིན་པ་དང་། །ཀུན་འཛིན་ཞེ་སྡང་ཡིན་སྟོན་ཅིང་།
en: And that thorough comprehension is anger,

source: །ཀུན་འཛིན་སྒོ་ནི་སློབ་པ་ཡིན།
en: Will train in the gateway of thorough comprehension.

source: །དེ་བཞིན་ཞེ་སྡང་གང་མཆོད་པ།
en: “Likewise, those who worship anger

source: །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་པར་འགྱུར།
en: They will perfect the gateway of thorough comprehension. “Since they realize

source: །དེས་ནི་གཏི་མུག་སངས་རྒྱས་ལམ།
en: That ignorance and the path of the buddhas

source: །གཏི་མུག་ལ་ནི་ཞེན་པ་མེད།
en: They will not cling to ignorance. “Those who genuinely realize

source: །གལ་ཏེ་གཏི་མུག་ཉིད་ཀྱི་མཐའ། །ཡང་དག་ཇི་བཞིན་རྟོགས་གྱུར་ན།
en: The limit of ignorance

source: །དེས་ནི་སངས་རྒྱས་ལམ་བསྒྲུབས་པས།
en: Will accomplish the path of the buddhas

source: །གཏི་མུག་ཀུན་འཛིན་ཡིན་པ་དང་། །ཀུན་འཛིན་གཏི་མུག་ཡིན་སྟོན་ཅིང་།
en: And that thorough comprehension is ignorance,

source: །དེ་བཞིན་གཏི་མུག་གང་མཆོད་པ།
en: “Likewise, those who worship ignorance

source: །དེ་ནི་ཆོས་ལ་མཆོད་པ་ཡིན།
en: Worship the Dharma,

source: །ཆོས་ལ་མཆོད་པ་བྱས་པའི་ཕྱིར།
en: And since they worship the Dharma,

source: །དེ་ནི་དགེ་འདུན་མཆོད་པ་ཡིན།
en: Worship the Saṅgha,

source: །དགེ་འདུན་ལ་ནི་མཆོད་པའི་ཕྱིར།
en: And since they worship the Saṅgha,

source: །དེ་ནི་ཚུལ་ཁྲིམས་མཆོད་པ་ཡིན།
en: Worship discipline,

source: །ཚུལ་ཁྲིམས་ལ་ནི་མཆོད་པའི་ཕྱིར།
en: And since they worship discipline,

source: །བརྩོན་འགྲུས་ལ་ནི་མཆོད་པ་ཡིན།
en: Worship diligence,

source: །བརྩོན་འགྲུས་ལ་ནི་མཆོད་པའི་ཕྱིར།
en: And since they worship diligence,

source: །བསྔགས་པ་བརྗོད་ཅིང་མཆོད་པ་ཡིན།
en: Worship the buddhas and proclaim their praises,

source: །བསྔགས་པ་བརྗོད་ཅིང་མཆོད་པའི་ཕྱིར།
en: And since they worship them and proclaim their praises,

source: །སངས་རྒྱས་ཆོས་ལ་མཆོད་པའི་ཕྱིར།
en: Worship the qualities of the buddhas, And since they worship the qualities of the buddhas,

source: །ཆོས་ཉིད་ལ་ནི་མཆོད་པ་ཡིན།
en: Worship reality,

source: །ཆོས་ཉིད་ལ་ནི་མཆོད་པའི་ཕྱིར།
en: And since they worship reality,

source: །དེ་བཞིན་ཉིད་ལ་མཆོད་པ་ཡིན།
en: Worship suchness,

source: །དེ་བཞིན་ཉིད་ལ་མཆོད་པའི་ཕྱིར།
en: And since they worship suchness,

source: །སྐྱེ་བ་མེད་ལ་མཆོད་པ་ཡིན།
en: Worship the unborn,

source: །སྐྱེ་བ་མེད་ལ་མཆོད་པའི་ཕྱིར།
en: And since they worship the unborn,

source: །འགག་པ་མེད་ལ་མཆོད་པ་ཡིན།
en: Worship the unceasing,

source: །འགག་པ་མེད་ལ་མཆོད་པའི་ཕྱིར།
en: And since they worship the unceasing,

source: །ཟག་པ་མེད་ལ་མཆོད་པ་ཡིན།
en: Worship the undefiled,

source: །ཟག་པ་མེད་ལ་མཆོད་པའི་ཕྱིར།
en: And since they worship the undefiled,

source: །ཅི་ཡང་མེད་ལ་མཆོད་པ་ཡིན།
en: Worship complete nonexistence,

source: །ཅི་ཡང་མེད་ལ་མཆོད་པའི་ཕྱིར།
en: And since they worship complete nonexistence,

source: །དཔག་ཏུ་མེད་ལ་མཆོད་པ་ཡིན།
en: Worship the boundless,

source: །དཔག་ཏུ་མེད་ལ་མཆོད་པའི་ཕྱིར།
en: And since they worship the boundless,

source: །སྲིད་པ་གསུམ་ལ་མཆོད་པ་ཡིན།
en: Worship the three realms,

source: །སྲིད་པ་གསུམ་ལ་མཆོད་པའི་ཕྱིར།
en: And since they worship the three realms,

source: །རབ་དབེན་ལ་ནི་མཆོད་པ་ཡིན།
en: Worship disengagement,

source: །རབ་དབེན་ལ་ནི་མཆོད་པའི་ཕྱིར།
en: And since they worship disengagement,

source: །འཁོར་བར་འཇུག་ལ་མཆོད་པ་ཡིན།
en: Worship engagement in saṃsāra,

source: །འཁོར་བར་འཇུག་ལ་མཆོད་པའི་ཕྱིར།
en: And since they worship engagement in saṃsāra,

source: །འཇུག་པ་མེད་ལ་མཆོད་པ་ཡིན།
en: Worship the absence of engagement,

source: །འཇུག་པ་མེད་ལ་མཆོད་པའི་ཕྱིར།
en: And since they worship the absence of engagement,

source: །ཡོད་པ་མིན་ལ་མཆོད་པ་ཡིན།
en: Worship nonexistence,

source: །ཡོད་པ་མིན་ལ་མཆོད་པའི་ཕྱིར།
en: And since they worship nonexistence,

source: །བྱུང་བ་མེད་ལ་མཆོད་པ་ཡིན།
en: Worship the absence of origination,

source: །བྱུང་བ་མེད་ལ་མཆོད་པའི་ཕྱིར།
en: And since they worship the absence of origination,

source: །ཉེ་བར་ཞི་ལ་མཆོད་པ་ཡིན།
en: Worship peace,

source: །ཉེ་བར་ཞི་ལ་མཆོད་པའི་ཕྱིར།
en: And since they worship peace,

source: །འོང་བ་མེད་ལ་མཆོད་པ་ཡིན།
en: Worship the absence of coming,

source: །འོང་བ་མེད་ལ་མཆོད་པའི་ཕྱིར།
en: And since they worship the absence of coming,

source: །འགྲོ་བ་མེད་ལ་མཆོད་པ་ཡིན།
en: Worship the absence of going,

source: །འགྲོ་བ་མེད་ལ་མཆོད་པའི་ཕྱིར།
en: And since they worship the absence of going,

source: །ཀུན་འཛིན་ནི་སྒོ་ནི་རྫོགས་པར་འགྱུར།
en: They will perfect the gateway of thorough comprehension.

source: །འདུས་བྱས་ལ་ནི་མཆོད་པ་ཡིན།
en: Worship the conditioned,

source: །འདུས་བྱས་ལ་ནི་མཆོད་པའི་ཕྱིར།
en: And since they worship the conditioned,

source: །སྡུག་བསྔལ་ལ་སོགས་མཆོད་པ་ཡིན།
en: Worship suffering and so forth,

source: །སྡུག་བསྔལ་ལ་སོགས་མཆོད་པའི་ཕྱིར།
en: And since they worship suffering and so forth,

source: །སྡུག་བསྔལ་ཤེས་ལ་མཆོད་པ་ཡིན།
en: Worship the knowledge of suffering,

source: །སྡུག་བསྔལ་ཤེས་ལ་མཆོད་པའི་ཕྱིར།
en: And since they worship the knowledge of suffering,

source: །ཀུན་འབྱུང་ཤེས་ལ་མཆོད་པ་ཡིན།
en: Worship the knowledge of the origin,

source: །ཀུན་འབྱུང་ཤེས་ལ་མཆོད་པའི་ཕྱིར།
en: And since they worship the knowledge of the origin,

source: །འགོག་པ་ཤེས་ལ་མཆོད་པ་ཡིན།
en: Worship the knowledge of cessation,

source: །འགོག་པ་ཤེས་ལ་མཆོད་པའི་ཕྱིར།
en: And since they worship the knowledge of cessation,

source: །ལམ་ཤེས་ལ་ནི་མཆོད་པ་ཡིན།
en: Worship the knowledge of the path,

source: །ལམ་ཤེས་ལ་ནི་མཆོད་པའི་ཕྱིར།
en: And since they worship the knowledge of the path,

source: །ཆོས་ཤེས་ལ་ནི་མཆོད་པ་ཡིན།
en: Worship the knowledge of the Dharma,

source: །ཆོས་ཤེས་ལ་ནི་མཆོད་པའི་ཕྱིར།
en: And since they worship the knowledge of the Dharma,

source: །རྗེས་ལ་ཤེས་ལ་མཆོད་པ་ཡིན།
en: Worship the knowledge of the subsequent,

source: །རྗེས་ལ་ཤེས་ལ་མཆོད་པའི་ཕྱིར།
en: And since they worship the knowledge of the subsequent,

source: །སྐྱེ་མེད་ཡེ་ཤེས་མཆོད་པ་ཡིན།
en: Worship the wisdom of the unborn,

source: །སྐྱེ་མེད་ཡེ་ཤེས་མཆོད་པའི་ཕྱིར།
en: And since they worship the wisdom of the unborn,

source: །ཟད་པའི་ཡེ་ཤེས་མཆོད་པ་ཡིན།
en: Worship the wisdom of exhaustion,

source: །ཟད་པའི་ཡེ་ཤེས་མཆོད་པའི་ཕྱིར།
en: And since they worship the wisdom of exhaustion,

source: །དེ་བཞིན་ཡང་དག་སྤོང་བ་དང་། །དྲན་པ་ཉེར་གཞག་རྫུ་འཕྲུལ་རྐང་།
en: The applications of mindfulness, The bases of miraculous power,

source: །དབང་པོ་ལྔ་དང་སྟོབས་ལྔ་དང་། །བྱང་ཆུབ་ཡན་ལག་བདུན་པོ་དང་། །ཡན་ལག་བརྒྱད་པའི་ལམ་དག་དང་། །ཞི་གནས་ལྷག་མཐོང་ལ་སོགས་པ། །ཆོས་ནི་རྣམ་པ་དགུ་པོ་རྣམས། །ཐམས་ཅད་དེ་བཞིན་སྦྱར་བར་བྱ།
en: “The five powers , the five strengths, The seven factors of awakening, The eightfold path, Tranquility, insight, and so forth.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་སེམས་ཅན་གང་ལ་ལ་ཞིག་ཐེག་པ་ལ་གནས་ནས། གོང་དུ་ཇི་སྐད་བསྟན་པའི་གཟུངས་མངོན་པར་བསྒྲུབ་པར་འདོད་པས་གང་ཟག་རྣམ་པ་བརྒྱད་ཅུ་ཡོངས་སུ་སྤང་བར་བྱའོ། །རྣམ་པ་བརྒྱད་ཅུ་གང་ཞེ་ན།
en: Then the Blessed One said to Candraprabhakumārabhūta, “Noble son, the followers of the Great Vehicle who wish to accomplish the dhāraṇīs that were revealed earlier should stay away from eighty types of persons. What are they?
